# 4.9: Intro to Data Visualization with Python- Part 1

### Contents list
#### 01 Importing Visualization Libraries
#### 02 Wrangle Customers Dataframe
-	2-1 Renaming the columns to keep them consistent and clear
-	2-2 2-2 Investigating 'customers' dataframe
-	2-3 Changing the variable datatypes to save memory usage

#### 03 Data Consistency Checks
-	3-1 Checking for mixed datatypes
-	3-2 Checking missing data in customers
-	3-3 Finding Duplicates

#### 04 Merge the customer and ords_prods datasets
#### 05 Export the wrangled customers
#### 06  Export the merged dataset
** **

### 01 Importing Visualization Libraries

In [3]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
#set path

path = r"C:\Users\mehrn\OneDrive\Desktop\CareerFoundry Materials\Tasks\Python\10-01-23 Instacart Basket Analysis"

In [3]:
# Import the latest version of merged dataset 

ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Updated_aggregated_ords_prods.pkl'))

In [5]:
# Import the customer dataset 

customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
ords_prods.shape

(30741973, 25)

In [6]:
ords_prods['prices'].max()

24.9

In [7]:
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,order_behavior,order_frequency_flag
0,2539329,1,1,2,8,-1.0,True,196.0,1.0,0.0,...,Mid-range product,Regularly busy,Regularly days,Most orders,10,New customer,7.894531,Low spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,False,196.0,1.0,1.0,...,Mid-range product,Regularly busy,two slowest days,Most orders,10,New customer,7.894531,Low spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,False,196.0,1.0,1.0,...,Mid-range product,Regularly busy,two slowest days,Most orders,10,New customer,7.894531,Low spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,False,196.0,1.0,1.0,...,Mid-range product,Least busy,two slowest days,Most orders,10,New customer,7.894531,Low spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,False,196.0,1.0,1.0,...,Mid-range product,Least busy,two slowest days,Most orders,10,New customer,7.894531,Low spender,20.0,Regular customer

In [8]:
customers.shape

(206209, 10)

In [9]:
customers

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

### 02 Wrangle Customers Dataframe

#### 2-1 Renaming the columns to keep them consistent and clear

In [10]:
# Rename the fam_status column

customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [11]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [12]:
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [13]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [7]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [16]:
customers.rename(columns = {'n_dependants' : 'no_of_dependents'}, inplace = True)

In [17]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

#### 2-2 Investigating 'customers' dataframe

In [18]:
# Checking 'customers' dataframe

customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
# Checking the primary key column

customers['user_id'].describe()

count    206209.000000
mean     103105.000000
std       59527.555167
min           1.000000
25%       51553.000000
50%      103105.000000
75%      154657.000000
max      206209.000000
Name: user_id, dtype: float64

In [20]:
# Checking 'state' column for missing data

customers['state'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: state, dtype: int64

In [21]:
# Checking memory usage and columns

customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   first_name        194950 non-null  object
 2   last_name         206209 non-null  object
 3   gender            206209 non-null  object
 4   state             206209 non-null  object
 5   age               206209 non-null  int64
 6   date_joined       206209 non-null  object
 7   no_of_dependents  206209 non-null  int64
 8   marital_status    206209 non-null  object
 9   income            206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [22]:
# Checking datatypes

customers.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependents     int64
marital_status      object
income               int64
dtype: object

In [13]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30741973 entries, 0 to 32312455
Data columns (total 25 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_time_of_day       int8
 5   days_since_prior_order  float16
 6   new_customer            bool
 7   product_id              float16
 8   add_to_cart_order       float16
 9   reordered               float16
 10  product_name            object
 11  aisle_id                int8
 12  department_id           int8
 13  prices                  float16
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int8
 20  loyalty_flag            object
 21  avg_price               float16
 22  spending_flag           object
 23  order_behavior          float16
 24  order_frequency_flag    object
dtypes: bool(1), category(1), float16(7), int32(2), int8(6), object(8)
memory usage: 2.9+ GB

#### 2-3 Changing the variable datatypes to save memory usage

In [23]:
# Changing the variable datatypes to save memory usage

customers['age'] = customers['age'].astype('int8')

In [24]:
customers['user_id'] = customers['user_id'].astype('int32')

In [26]:
customers['no_of_dependents'] = customers['no_of_dependents'].astype('int8')

In [27]:
customers['income'] = customers['income'].astype('int32')

### 03 Data Consistency Checks

#### 3-1 Checking for mixed datatypes

In [8]:
# Checking for mixed datatypes

for col in customers.columns.tolist():
    weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis =1)
    if len(customers[weird])>0 :
        print(col)

First Name

In [13]:
(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis =1)

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [9]:
customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [11]:
customers[[col]].iloc[0].apply(type)

income    <class 'int'>
Name: 0, dtype: object

In [12]:
 (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type))

        income
0        False
1        False
2        False
3        False
4        False
...        ...
206204   False
206205   False
206206   False
206207   False
206208   False

[206209 rows x 1 columns]

In [10]:
customers[['age']].applymap(type)

                  age
0       <class 'int'>
1       <class 'int'>
2       <class 'int'>
3       <class 'int'>
4       <class 'int'>
...               ...
206204  <class 'int'>
206205  <class 'int'>
206206  <class 'int'>
206207  <class 'int'>
206208  <class 'int'>

[206209 rows x 1 columns]

#### Result: Column 'first_name' has a mixed data type

In [21]:
# Fix the mixed datatype of first_name
customers['first_name'] = customers['first_name'].astype('str')

In [22]:
customers.dtypes

user_id            int32
first_name        object
last_name         object
gender            object
state             object
age                 int8
date_joined       object
n_dependants        int8
marital_status    object
income             int32
dtype: object

#### 3-2 Checking missing data in customers

In [29]:
# Finding missing data

customers.isnull().sum()

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
no_of_dependents        0
marital_status          0
income                  0
dtype: int64

#### Result: Column 'first_name' has 11259 missing values

In [33]:
# viewing missing data

cx_nan = customers[customers['first_name'].isnull() == True]

In [35]:
cx_nan

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

#### 3-3 Finding Duplicates

In [24]:
# Finding Duplicates

customers_dups= customers[customers.duplicated()]

In [14]:
customers.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [25]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

#### Result: No duplicates found

### 04 Merge the customer and ords_prods datasets

In [36]:
# Merge the customer and ords_prods datasets

cx_ords_prods = customers.merge(ords_prods, on = 'user_id')

### 05 Export the wrangled customers

In [37]:
# Export the wrangled customers dataset

customers.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'customers_wrangled.pkl'))

### 06  Export the merged dataset

In [39]:
# Export the merged dataframe

cx_ords_prods.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'cx_ords_prods.pkl'))